{
  "generated": "2025-12-25T00:00:00.000Z",
  "version": "2.0",
  "totalCards": 142,
  "cards": [
    {
      "id": "ch5-muni-001",
      "front": "What is a general obligation (GO) bond?",
      "back": "A municipal bond backed by the full faith, credit, and taxing power of the issuer. GO bonds are typically backed by ad valorem (property) taxes.",
      "chapter": "chapter-05",
      "section": 1,
      "tags": [
        "municipal-bonds",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-muni-002",
      "front": "What is a revenue bond?",
      "back": "A municipal bond backed only by revenue from a specific project (e.g., tolls, hospital fees, arena revenue). Revenue bonds are NOT backed by the issuer's taxing power.",
      "chapter": "chapter-05",
      "section": 1,
      "tags": [
        "municipal-bonds",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-muni-003",
      "front": "Which type of municipal bond is typically riskier: GO bonds or revenue bonds?",
      "back": "Revenue bonds are typically riskier because they lack the backing of the municipality's taxing power and depend on a specific project generating sufficient revenue.",
      "chapter": "chapter-05",
      "section": 1,
      "tags": [
        "municipal-bonds",
        "comparison"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-muni-004",
      "front": "What is an ad valorem tax?",
      "back": "A property tax based on the assessed value of real estate. Ad valorem taxes typically back general obligation bonds issued by local governments.",
      "chapter": "chapter-05",
      "section": 1,
      "tags": [
        "municipal-bonds",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-muni-005",
      "front": "What is a statutory debt limit?",
      "back": "A legal maximum on the dollar amount of GO bonds a municipality can have outstanding at any time. The limit can only be changed through legislative action or public referendum.",
      "chapter": "chapter-05",
      "section": 1,
      "tags": [
        "municipal-bonds",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-muni-006",
      "front": "What is a bond counsel?",
      "back": "A law firm retained by a municipal issuer to examine a bond issue and provide a legal opinion on its legality, validity, and tax-exempt status.",
      "chapter": "chapter-05",
      "section": 1,
      "tags": [
        "municipal-bonds",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-muni-007",
      "front": "What is the difference between a qualified and unqualified legal opinion on municipal bonds?",
      "back": "An unqualified opinion means the bond counsel found no legal problems with the issue. A qualified opinion means there is a legal uncertainty that purchasers should be aware of. Issuers prefer unqualified opinions.",
      "chapter": "chapter-05",
      "section": 1,
      "tags": [
        "municipal-bonds",
        "comparison"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-muni-008",
      "front": "What is an official statement?",
      "back": "The disclosure document for municipal securities, similar to a prospectus for corporate securities. It contains information about the bonds and the financial condition of the issuer.",
      "chapter": "chapter-05",
      "section": 1,
      "tags": [
        "municipal-bonds",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-muni-009",
      "front": "What is a double-barreled bond?",
      "back": "A municipal bond backed by BOTH a specific revenue source AND the full faith, credit, and taxing power of the issuer. This combined backing typically improves the credit rating.",
      "chapter": "chapter-05",
      "section": 1,
      "tags": [
        "municipal-bonds",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-muni-010",
      "front": "What is a moral obligation bond?",
      "back": "A municipal bond backed by the promise (but not legal obligation) to pay. A state legislature may be authorized, but not required, to appropriate funds if the issuer cannot pay.",
      "chapter": "chapter-05",
      "section": 1,
      "tags": [
        "municipal-bonds",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-muni-011",
      "front": "What is a special assessment bond?",
      "back": "A municipal bond used to fund improvements that benefit only a specific area. Only property owners in that area are assessed higher taxes to pay for the improvement (e.g., new streetlights or sidewalks).",
      "chapter": "chapter-05",
      "section": 1,
      "tags": [
        "municipal-bonds",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-muni-012",
      "front": "What is a certificate of participation (COP)?",
      "back": "A municipal financing instrument that allows issuers to continue issuing debt despite reaching their debt limit. Investors receive lease payments from a facility built with COP proceeds. Not legally a GO bond since the municipality is not obligated to fund them.",
      "chapter": "chapter-05",
      "section": 1,
      "tags": [
        "municipal-bonds",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-muni-013",
      "front": "What is a TAN (Tax Anticipation Note)?",
      "back": "A short-term municipal note issued in anticipation of future property (ad valorem) tax receipts. TANs are paid off from those tax collections.",
      "chapter": "chapter-05",
      "section": 1,
      "tags": [
        "municipal-bonds",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-muni-014",
      "front": "What is a RAN (Revenue Anticipation Note)?",
      "back": "A short-term municipal note issued in anticipation of future revenue collections and non-ad valorem tax collections. RANs are paid off from those revenues.",
      "chapter": "chapter-05",
      "section": 1,
      "tags": [
        "municipal-bonds",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-muni-015",
      "front": "What is a BAN (Bond Anticipation Note)?",
      "back": "A short-term municipal note issued to start capital projects. The note is paid off when the final long-term bond is issued. Most BANs are secured by a GO pledge.",
      "chapter": "chapter-05",
      "section": 1,
      "tags": [
        "municipal-bonds",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-muni-016",
      "front": "What is the tax treatment of municipal bond interest income?",
      "back": "Municipal bond interest is exempt from federal income tax. For in-state residents, it may also be exempt from state and local taxes (triple tax exempt). Bonds from U.S. territories (Puerto Rico, Guam, Virgin Islands) are triple tax exempt for all U.S. investors.",
      "chapter": "chapter-05",
      "section": 1,
      "tags": [
        "municipal-bonds",
        "taxation"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-muni-017",
      "front": "Who regulates broker-dealers and advisers dealing in municipal securities?",
      "back": "The Municipal Securities Rulemaking Board (MSRB). Note: The MSRB has no authority over municipal issuers themselves, which are self-governing.",
      "chapter": "chapter-05",
      "section": 1,
      "tags": [
        "municipal-bonds",
        "regulation"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-muni-018",
      "front": "What is a feasibility study for revenue bonds?",
      "back": "A study conducted by outside consultants to ensure a proposed project makes economic sense before revenue bonds are issued. It includes projected costs, expected revenues, and an engineer's report.",
      "chapter": "chapter-05",
      "section": 1,
      "tags": [
        "municipal-bonds",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-muni-019",
      "front": "Do debt limits apply to revenue bonds?",
      "back": "No. Debt limits apply only to GO bonds. Revenue bonds are self-supporting from specific project revenues and do not count against a municipality's statutory debt limit.",
      "chapter": "chapter-05",
      "section": 1,
      "tags": [
        "municipal-bonds",
        "comparison"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-mm-020",
      "front": "What are money market instruments?",
      "back": "Debt securities that mature in one year or less. They are highly liquid, relatively safe, and offer lower yields. Examples include T-bills, commercial paper, and banker's acceptances.",
      "chapter": "chapter-05",
      "section": 2,
      "tags": [
        "money-market",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-mm-021",
      "front": "What is a Treasury bill (T-bill)?",
      "back": "A U.S. government-backed money market security offered with 1-month, 3-month, 6-month, and 12-month maturities. T-bills are considered the safest investments available.",
      "chapter": "chapter-05",
      "section": 2,
      "tags": [
        "money-market",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-mm-022",
      "front": "What is commercial paper?",
      "back": "Unsecured, short-term corporate debt with a maximum maturity of 270 days. Only highly creditworthy corporations can issue commercial paper since it has no collateral.",
      "chapter": "chapter-05",
      "section": 2,
      "tags": [
        "money-market",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-mm-023",
      "front": "What is a banker's acceptance (BA)?",
      "back": "A bank-guaranteed instrument used to finance imports and exports. The bank's guarantee transforms a risky international trade transaction into a relatively safe one.",
      "chapter": "chapter-05",
      "section": 2,
      "tags": [
        "money-market",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-mm-024",
      "front": "What is a repurchase agreement (repo)?",
      "back": "An arrangement where a dealer sells securities to another party with an agreement to buy them back later at a price that includes a fixed yield. Repos are collateralized short-term loans using securities as collateral.",
      "chapter": "chapter-05",
      "section": 2,
      "tags": [
        "money-market",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-mm-025",
      "front": "What is the difference between the federal funds rate and the discount rate?",
      "back": "The federal funds rate is the market-determined rate for overnight loans between banks. The discount rate is set by the Federal Reserve and is the rate at which the Fed lends to member banks.",
      "chapter": "chapter-05",
      "section": 2,
      "tags": [
        "money-market",
        "comparison"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-mm-026",
      "front": "What happens when the Federal Reserve buys money market instruments?",
      "back": "It puts cash into banks, increasing credit availability and loosening monetary policy.",
      "chapter": "chapter-05",
      "section": 2,
      "tags": [
        "money-market",
        "fed-policy"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-mm-027",
      "front": "What is a negotiable certificate of deposit (CD)?",
      "back": "A jumbo CD with a minimum face amount of $100,000 that can be traded in the secondary market. Negotiable CDs typically have maturities of less than 1 year.",
      "chapter": "chapter-05",
      "section": 2,
      "tags": [
        "money-market",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-ic-028",
      "front": "What are the three types of investment companies under the Investment Company Act of 1940?",
      "back": "1) Face-amount certificate companies (historical relic), 2) Management companies (open-end and closed-end funds), and 3) Unit Investment Trusts (UITs).",
      "chapter": "chapter-06",
      "section": 1,
      "tags": [
        "investment-companies",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-ic-029",
      "front": "What is an open-end fund (mutual fund)?",
      "back": "A management company that continuously creates new shares when investors buy and retires shares when investors sell. Shares are redeemed at NAV (not traded on an exchange).",
      "chapter": "chapter-06",
      "section": 1,
      "tags": [
        "investment-companies",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-ic-030",
      "front": "What is a closed-end fund?",
      "back": "A management company with a fixed number of shares after the IPO. Shares trade on an exchange like stocks and can trade at a premium or discount to NAV.",
      "chapter": "chapter-06",
      "section": 1,
      "tags": [
        "investment-companies",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-ic-031",
      "front": "What is a Unit Investment Trust (UIT)?",
      "back": "An investment company with a FIXED portfolio (no active management), a TERMINATION DATE, and NO board of directors (has a trustee instead). Issues shares of beneficial interest.",
      "chapter": "chapter-06",
      "section": 1,
      "tags": [
        "investment-companies",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-ic-032",
      "front": "Can open-end funds trade at a premium or discount to NAV?",
      "back": "No. Open-end funds always trade at NAV. Only closed-end funds can trade at a premium or discount to NAV because they trade on exchanges based on supply and demand.",
      "chapter": "chapter-06",
      "section": 1,
      "tags": [
        "investment-companies",
        "comparison"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-ic-033",
      "front": "When is a prospectus required for mutual fund purchases?",
      "back": "A prospectus is required for EVERY purchase of open-end fund shares because each purchase is a primary offering (the fund creates new shares). Closed-end funds only require a prospectus at the IPO.",
      "chapter": "chapter-06",
      "section": 1,
      "tags": [
        "investment-companies",
        "regulation"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-fm-034",
      "front": "What is the 75-5-10 rule for diversified investment companies?",
      "back": "For 75% of assets: at least 75% must be invested in securities, no more than 5% in any one issuer, and no more than 10% of any issuer's voting securities. The remaining 25% can be invested however the fund chooses.",
      "chapter": "chapter-06",
      "section": 2,
      "tags": [
        "investment-companies",
        "regulation"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-fm-035",
      "front": "What is the role of a custodian bank for a mutual fund?",
      "back": "The custodian bank holds and safeguards the fund's assets (securities and cash). It may also act as transfer agent and paying agent.",
      "chapter": "chapter-06",
      "section": 2,
      "tags": [
        "investment-companies",
        "fund-structure"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-fm-036",
      "front": "What is the role of an investment adviser for a mutual fund?",
      "back": "The investment adviser manages the fund's portfolio by making buy/sell decisions within the fund's stated objectives. Their contract must be approved by shareholders.",
      "chapter": "chapter-06",
      "section": 2,
      "tags": [
        "investment-companies",
        "fund-structure"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-bs-037",
      "front": "What is NAV (Net Asset Value)?",
      "back": "The per-share value of a fund, calculated daily as: (Total Assets - Total Liabilities) / Shares Outstanding",
      "chapter": "chapter-06",
      "section": 3,
      "tags": [
        "investment-companies",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-bs-038",
      "front": "What is POP (Public Offering Price)?",
      "back": "The price investors pay to buy mutual fund shares: POP = NAV + Sales Charge. The maximum sales charge is 8.5% of POP.",
      "chapter": "chapter-06",
      "section": 3,
      "tags": [
        "investment-companies",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-bs-039",
      "front": "How is the sales charge percentage calculated for mutual funds?",
      "back": "Sales Charge % = (POP - NAV) / POP. Always divide by POP, not NAV. Example: NAV $9.15, POP $10.00 = ($10-$9.15)/$10 = 8.5%",
      "chapter": "chapter-06",
      "section": 3,
      "tags": [
        "investment-companies",
        "calculation"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-bs-040",
      "front": "What is forward pricing for mutual funds?",
      "back": "Orders are filled at the NEXT calculated NAV (typically 4:00 PM). If you place an order at 2:00 PM, you get the 4:00 PM price. This applies only to open-end funds.",
      "chapter": "chapter-06",
      "section": 3,
      "tags": [
        "investment-companies",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-bs-041",
      "front": "What are breakpoints for mutual fund sales charges?",
      "back": "Volume discounts that reduce the sales charge for larger purchases. Funds must offer breakpoints to charge the maximum 8.5% sales charge. Investment clubs do NOT qualify for breakpoints.",
      "chapter": "chapter-06",
      "section": 3,
      "tags": [
        "investment-companies",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-bs-042",
      "front": "What is a Letter of Intent (LOI)?",
      "back": "An agreement to qualify for breakpoints based on intended future purchases. Can be backdated 90 days and must be completed within 13 months. Only new money counts (not appreciation or reinvested dividends).",
      "chapter": "chapter-06",
      "section": 3,
      "tags": [
        "investment-companies",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-bs-043",
      "front": "What are Rights of Accumulation?",
      "back": "Breakpoint pricing for subsequent purchases based on the CURRENT market value of existing holdings, including appreciation and reinvested dividends. Can include combined holdings across related accounts.",
      "chapter": "chapter-06",
      "section": 3,
      "tags": [
        "investment-companies",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-exp-044",
      "front": "What is a 12b-1 fee?",
      "back": "An annual fee charged to offset marketing, advertising, and distribution expenses. Maximum is 1% for load funds and 0.25% for no-load funds. Requires approval from shareholders, board, AND independent board members.",
      "chapter": "chapter-06",
      "section": 4,
      "tags": [
        "investment-companies",
        "fees"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-exp-045",
      "front": "What are the characteristics of Class A shares?",
      "back": "Front-end load (up to 8.5%), lower 12b-1 fees, eligible for breakpoints. Best for long-term investors with significant assets.",
      "chapter": "chapter-06",
      "section": 4,
      "tags": [
        "investment-companies",
        "share-classes"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-exp-046",
      "front": "What are the characteristics of Class B shares?",
      "back": "No front-end load, back-end CDSC (declines over time), higher 12b-1 fees, often converts to Class A after 5-7 years. NOT eligible for breakpoints.",
      "chapter": "chapter-06",
      "section": 4,
      "tags": [
        "investment-companies",
        "share-classes"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-exp-047",
      "front": "What are the characteristics of Class C shares?",
      "back": "No or minimal front-end load, small CDSC (typically 1% if sold within first year), higher ongoing 12b-1 fees, no conversion to Class A. NOT eligible for breakpoints. Best for short-term investors.",
      "chapter": "chapter-06",
      "section": 4,
      "tags": [
        "investment-companies",
        "share-classes"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-exp-048",
      "front": "What is a CDSC (Contingent Deferred Sales Charge)?",
      "back": "A back-end sales charge applied when Class B shares are sold early. The charge typically declines over time (e.g., 5% in year 1, 4% in year 2, etc.) until it reaches 0%.",
      "chapter": "chapter-06",
      "section": 4,
      "tags": [
        "investment-companies",
        "fees"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-exp-049",
      "front": "Within how many calendar days must a fund pay redemption proceeds?",
      "back": "7 calendar days. This applies to all mutual fund redemption requests.",
      "chapter": "chapter-06",
      "section": 4,
      "tags": [
        "investment-companies",
        "regulation"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-dist-050",
      "front": "What is Subchapter M of the IRS Code?",
      "back": "A tax provision that allows investment companies to avoid corporate-level taxation if they distribute at least 90% of net investment income to shareholders. This provides pass-through taxation similar to partnerships.",
      "chapter": "chapter-06",
      "section": 5,
      "tags": [
        "investment-companies",
        "taxation"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-dist-051",
      "front": "Are reinvested mutual fund dividends taxable?",
      "back": "Yes. Shareholders owe taxes on distributions in the year received, whether taken in cash or reinvested. Reinvestment does NOT defer taxes.",
      "chapter": "chapter-06",
      "section": 5,
      "tags": [
        "investment-companies",
        "taxation"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-dist-052",
      "front": "What is 'breakpoint selling' and why is it prohibited?",
      "back": "Selling shares just below a breakpoint threshold to avoid giving the customer a sales charge discount. It's prohibited because it harms the customer by making them pay higher fees.",
      "chapter": "chapter-06",
      "section": 5,
      "tags": [
        "investment-companies",
        "prohibited-practices"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-dist-053",
      "front": "What is 'selling dividends' and why is it prohibited?",
      "back": "Encouraging customers to buy shares right before a dividend distribution. It's prohibited because the customer doesn't benefit - they receive the dividend but the NAV drops by that amount, creating a tax liability with no actual gain.",
      "chapter": "chapter-06",
      "section": 5,
      "tags": [
        "investment-companies",
        "prohibited-practices"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-dist-054",
      "front": "What is churning in mutual fund sales?",
      "back": "Recommending unnecessary trades to generate sales charges. It's prohibited because it harms customers by creating unnecessary costs for the representative's benefit.",
      "chapter": "chapter-06",
      "section": 5,
      "tags": [
        "investment-companies",
        "prohibited-practices"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-other-055",
      "front": "What is an ETF (Exchange Traded Fund)?",
      "back": "A packaged product that trades on exchanges like a stock throughout the day. Uses creation units to keep prices near NAV. Generally has lower expense ratios than mutual funds and is more tax-efficient.",
      "chapter": "chapter-06",
      "section": 6,
      "tags": [
        "packaged-products",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-other-056",
      "front": "What is an ETN (Exchange Traded Note)?",
      "back": "A debt security (bond) that tracks an index. The investor is lending money to the issuer - if the issuer defaults, investors are unsecured creditors. ETNs have issuer credit risk that ETFs do not.",
      "chapter": "chapter-06",
      "section": 6,
      "tags": [
        "packaged-products",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-other-057",
      "front": "What is the key difference between an ETF and an ETN?",
      "back": "An ETF holds actual underlying assets, while an ETN is a debt security (IOU from the issuer). ETNs carry issuer credit risk - if the issuer fails, you're an unsecured creditor regardless of index performance.",
      "chapter": "chapter-06",
      "section": 6,
      "tags": [
        "packaged-products",
        "comparison"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-other-058",
      "front": "What is a leveraged ETF?",
      "back": "An ETF designed to deliver multiples of index performance (e.g., 2X or 3X). Due to daily rebalancing, they can diverge significantly from their target over longer periods. Designed for SHORT-TERM trading only.",
      "chapter": "chapter-06",
      "section": 6,
      "tags": [
        "packaged-products",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-other-059",
      "front": "What is an inverse ETF?",
      "back": "An ETF that moves opposite to its underlying index. If the index goes up 5%, the inverse ETF goes down 5%. Used for hedging or bearish speculation.",
      "chapter": "chapter-06",
      "section": 6,
      "tags": [
        "packaged-products",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-other-060",
      "front": "What are the Subchapter M requirements for REITs?",
      "back": "To avoid corporate taxation, REITs must: 1) Have 75% of income from real estate, 2) Have 75% of assets in real estate/govt securities/cash, 3) Distribute at least 90% of net investment income.",
      "chapter": "chapter-06",
      "section": 6,
      "tags": [
        "packaged-products",
        "regulation"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-other-061",
      "front": "How are REIT dividends taxed?",
      "back": "REIT dividends are taxed as ordinary income, NOT at the lower qualified dividend rate. The tax advantage is at the corporate level (REITs pay no corporate tax if they meet requirements).",
      "chapter": "chapter-06",
      "section": 6,
      "tags": [
        "packaged-products",
        "taxation"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-other-062",
      "front": "What is an accredited investor?",
      "back": "An investor with either: 1) Net worth over $1 million (excluding primary residence), OR 2) Annual income over $200K individual / $300K joint. Required for hedge funds and many private placements.",
      "chapter": "chapter-06",
      "section": 6,
      "tags": [
        "packaged-products",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-other-063",
      "front": "What is the typical hedge fund fee structure?",
      "back": "'2 and 20' - a 2% annual management fee plus 20% of profits (performance fee). Hedge funds are available only to accredited investors and typically have lock-up periods.",
      "chapter": "chapter-06",
      "section": 6,
      "tags": [
        "packaged-products",
        "fees"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-other-064",
      "front": "What is a DPP (Direct Participation Program)?",
      "back": "A limited partnership that passes income, gains, losses, and deductions directly to investors (pass-through taxation). Income is passive income. DPPs are typically illiquid.",
      "chapter": "chapter-06",
      "section": 6,
      "tags": [
        "packaged-products",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-other-065",
      "front": "What are the three types of oil and gas DPP programs?",
      "back": "1) Exploratory ('wildcat') - drilling new areas, highest risk/return. 2) Developmental ('step-out') - near existing fields, medium risk. 3) Income ('stripper') - buying producing wells, lowest risk.",
      "chapter": "chapter-06",
      "section": 6,
      "tags": [
        "packaged-products",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch7-mkt-066",
      "front": "What is the difference between the primary and secondary markets?",
      "back": "Primary market: New securities sold by the issuer (e.g., IPOs) - money goes to the issuer. Secondary market: Previously issued securities traded between investors - issuer receives nothing.",
      "chapter": "chapter-07",
      "section": 1,
      "tags": [
        "markets",
        "definition"
      ],
      "weight": 0.38
    },
    {
      "id": "ch7-mkt-067",
      "front": "What are the four secondary markets?",
      "back": "1) First market - exchanges (NYSE, Nasdaq). 2) Second market - OTC for unlisted securities. 3) Third market - OTC trading of listed securities. 4) Fourth market - institutional/dark pools.",
      "chapter": "chapter-07",
      "section": 1,
      "tags": [
        "markets",
        "definition"
      ],
      "weight": 0.38
    },
    {
      "id": "ch7-mkt-068",
      "front": "What is the difference between an auction market and a negotiated market?",
      "back": "Auction market (NYSE): One DMM per stock, competing bids and offers. Negotiated market (Nasdaq): Multiple market makers per stock, each posting their own prices.",
      "chapter": "chapter-07",
      "section": 1,
      "tags": [
        "markets",
        "comparison"
      ],
      "weight": 0.38
    },
    {
      "id": "ch7-mkt-069",
      "front": "What is a Designated Market Maker (DMM)?",
      "back": "A wholesaler of securities on the NYSE assigned to specific stocks. DMMs maintain orderly markets by keeping track of orders and buying/selling from their own inventory when necessary.",
      "chapter": "chapter-07",
      "section": 1,
      "tags": [
        "markets",
        "definition"
      ],
      "weight": 0.38
    },
    {
      "id": "ch7-mkt-070",
      "front": "What is a dark pool?",
      "back": "A private trading system in the fourth market that doesn't display quotes publicly. Used by institutions to execute large orders without revealing their intentions and preventing front-running.",
      "chapter": "chapter-07",
      "section": 1,
      "tags": [
        "markets",
        "definition"
      ],
      "weight": 0.38
    },
    {
      "id": "ch7-mkt-071",
      "front": "What is OTC Markets Group?",
      "back": "An electronic quotation system for OTC stocks organized into three tiers: OTCQX (highest standards), OTCQB (venture market), and OTC Pink (minimal disclosure). It is NOT an exchange and NOT an SRO.",
      "chapter": "chapter-07",
      "section": 1,
      "tags": [
        "markets",
        "definition"
      ],
      "weight": 0.38
    },
    {
      "id": "ch7-mkt-072",
      "front": "What is the difference between a broker and a dealer?",
      "back": "Broker (agent): Matches buyers and sellers, earns commission, holds no inventory. Dealer (principal): Trades from own inventory as counterparty, earns markup/markdown, bears market risk.",
      "chapter": "chapter-07",
      "section": 1,
      "tags": [
        "markets",
        "comparison"
      ],
      "weight": 0.38
    },
    {
      "id": "ch7-mkt-073",
      "front": "What is a 'hidden profit' in securities trading?",
      "back": "Charging both a commission AND a markup on the same transaction. This is prohibited - a firm must act as either broker (commission) OR dealer (markup), never both on the same trade.",
      "chapter": "chapter-07",
      "section": 1,
      "tags": [
        "markets",
        "prohibited-practices"
      ],
      "weight": 0.38
    },
    {
      "id": "ch7-mkt-074",
      "front": "What is FINRA's 5% markup policy?",
      "back": "A GUIDELINE (not a rule) that markups and commissions should be 'fair and reasonable.' 5% is not a cap - 3% on liquid stock may be excessive while 7% on illiquid OTC stock may be reasonable.",
      "chapter": "chapter-07",
      "section": 1,
      "tags": [
        "markets",
        "regulation"
      ],
      "weight": 0.38
    },
    {
      "id": "ch7-mkt-075",
      "front": "What securities are exempt from FINRA's 5% markup policy?",
      "back": "Mutual funds (maximum sales charge is 8.5%) and municipal bonds (subject to MSRB's 'fair and reasonable' standard instead).",
      "chapter": "chapter-07",
      "section": 1,
      "tags": [
        "markets",
        "regulation"
      ],
      "weight": 0.38
    },
    {
      "id": "ch7-mkt-076",
      "front": "What are the risks of after-hours trading?",
      "back": "Less liquidity, wider spreads, higher volatility, and potentially stale prices. Fewer buyers and sellers mean harder execution and amplified price swings.",
      "chapter": "chapter-07",
      "section": 1,
      "tags": [
        "markets",
        "risks"
      ],
      "weight": 0.38
    },
    {
      "id": "ch7-mkt-077",
      "front": "What is an ECN (Electronic Communication Network)?",
      "back": "A type of Alternative Trading System (ATS) that matches buyers and sellers electronically without routing through an exchange. Primarily serves institutional investors.",
      "chapter": "chapter-07",
      "section": 1,
      "tags": [
        "markets",
        "definition"
      ],
      "weight": 0.38
    },
    {
      "id": "ch8-ord-078",
      "front": "What information must be on an order ticket?",
      "back": "Buy/sell, security name, order size, duration (day or GTC), price (for limit orders), solicited/unsolicited, manager approval, representative name, customer name and account number.",
      "chapter": "chapter-08",
      "section": 1,
      "tags": [
        "trade-processing",
        "regulation"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-ord-079",
      "front": "What is the difference between a discretionary order and a 'market not held' order?",
      "back": "Discretionary: Rep chooses what security and/or how much (requires written POA and principal approval). Not held: Security and amount are specified, rep only has discretion over price/timing (NOT discretionary).",
      "chapter": "chapter-08",
      "section": 1,
      "tags": [
        "trade-processing",
        "comparison"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-ord-080",
      "front": "What does Regulation SHO require?",
      "back": "Every sell order must be marked as long or short. For short sales, the broker must 'locate' shares to be borrowed before the sale, and borrowed shares must be delivered on settlement.",
      "chapter": "chapter-08",
      "section": 1,
      "tags": [
        "trade-processing",
        "regulation"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-ord-081",
      "front": "What is front running?",
      "back": "Trading ahead of large block orders - using non-public information about pending orders to profit from the anticipated price movement. This is prohibited.",
      "chapter": "chapter-08",
      "section": 1,
      "tags": [
        "trade-processing",
        "prohibited-practices"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-ord-082",
      "front": "What is 'marking the close'?",
      "back": "Trading at or near market close, or falsely reporting trades, specifically to affect the closing price. This is a form of market manipulation and is prohibited.",
      "chapter": "chapter-08",
      "section": 1,
      "tags": [
        "trade-processing",
        "prohibited-practices"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-ord-083",
      "front": "What is a wash trade (painting the tape)?",
      "back": "Buying and selling the same security repeatedly with no actual change in ownership to create the false appearance of trading activity. This is market manipulation and prohibited.",
      "chapter": "chapter-08",
      "section": 1,
      "tags": [
        "trade-processing",
        "prohibited-practices"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-ord-084",
      "front": "What is interpositioning?",
      "back": "Routing a customer order through an unnecessary intermediary firm before reaching the market maker. Only permitted if it genuinely benefits the customer, which is rare.",
      "chapter": "chapter-08",
      "section": 1,
      "tags": [
        "trade-processing",
        "prohibited-practices"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-ord-085",
      "front": "What is backing away?",
      "back": "A market maker refusing to honor a posted quote. If you post a bid of $10.00, you must buy at that price when someone tries to sell. Backing away is prohibited by FINRA.",
      "chapter": "chapter-08",
      "section": 1,
      "tags": [
        "trade-processing",
        "prohibited-practices"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-set-086",
      "front": "What is the difference between clearing and settlement?",
      "back": "Clearing: Verifying both parties agree on trade details and preparing for settlement. Settlement: Actually exchanging cash for securities (ownership transfers).",
      "chapter": "chapter-08",
      "section": 2,
      "tags": [
        "trade-processing",
        "definition"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-set-087",
      "front": "What is the role of the DTCC?",
      "back": "The Depository Trust & Clearing Corporation is the parent company overseeing post-trade infrastructure. Its subsidiaries include the DTC (holds securities) and NSCC (clears trades).",
      "chapter": "chapter-08",
      "section": 2,
      "tags": [
        "trade-processing",
        "definition"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-set-088",
      "front": "What is the DTC (Depository Trust Company)?",
      "back": "The vault where securities positions are held in book-entry form (electronic records). Member firms maintain accounts at the DTC containing securities they hold for themselves and customers.",
      "chapter": "chapter-08",
      "section": 2,
      "tags": [
        "trade-processing",
        "definition"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-set-089",
      "front": "What is the NSCC (National Securities Clearing Corporation)?",
      "back": "Handles clearing of corporate securities trades by comparing trade submissions from both sides and instructing the DTC to adjust accounts on settlement date.",
      "chapter": "chapter-08",
      "section": 2,
      "tags": [
        "trade-processing",
        "definition"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-set-090",
      "front": "What is the role of the OCC (Options Clearing Corporation)?",
      "back": "Clears and guarantees options contract performance. When you buy a standardized exchange-traded option, the OCC stands between buyer and seller, guaranteeing the contract.",
      "chapter": "chapter-08",
      "section": 2,
      "tags": [
        "trade-processing",
        "definition"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-set-091",
      "front": "What is the difference between a clearing firm and an introducing firm?",
      "back": "Clearing firm: Handles back-office processing, maintains DTC/NSCC relationships. Introducing firm: Focuses on customer relationships but relies on a clearing firm to process trades.",
      "chapter": "chapter-08",
      "section": 2,
      "tags": [
        "trade-processing",
        "comparison"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-set-092",
      "front": "What is regular way settlement (T+1)?",
      "back": "Settlement one business day after the trade date. Applies to stocks, corporate bonds, municipal bonds, U.S. government securities, and listed options. Buy Monday, settle Tuesday.",
      "chapter": "chapter-08",
      "section": 2,
      "tags": [
        "trade-processing",
        "settlement"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-set-093",
      "front": "What is cash settlement?",
      "back": "Same-day settlement, for trades entered before 2:30 PM ET. Typically used for index options and commodity futures where physical delivery is impractical.",
      "chapter": "chapter-08",
      "section": 2,
      "tags": [
        "trade-processing",
        "settlement"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-set-094",
      "front": "What is a DK (Don't Know) notice?",
      "back": "A notice sent when one firm's trade records don't match the other firm's records. DK notices must be resolved within 20 minutes of receiving the mismatched trade report.",
      "chapter": "chapter-08",
      "section": 2,
      "tags": [
        "trade-processing",
        "definition"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-set-095",
      "front": "What is a CUSIP number?",
      "back": "A unique 9-character identifier assigned to all U.S. and Canadian registered securities. Used to identify securities in trade comparisons and settlement.",
      "chapter": "chapter-08",
      "section": 2,
      "tags": [
        "trade-processing",
        "definition"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-set-096",
      "front": "What is a signature guarantee (medallion)?",
      "back": "A guarantee from a FINRA member firm, bank, or savings institution confirming the signer's identity. Required for physical certificate transfers. NOT the same as a notary seal.",
      "chapter": "chapter-08",
      "section": 2,
      "tags": [
        "trade-processing",
        "definition"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-set-097",
      "front": "What is good delivery for stock certificates?",
      "back": "Certificates must be: endorsed by the registered owner, have a signature guarantee, and be in denominations that combine into round lots of 100 shares.",
      "chapter": "chapter-08",
      "section": 2,
      "tags": [
        "trade-processing",
        "settlement"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-set-098",
      "front": "What is accrued interest on bonds?",
      "back": "Interest accumulated since the last payment date that the buyer pays to the seller at settlement. This compensates the seller for interest earned but not yet received.",
      "chapter": "chapter-08",
      "section": 2,
      "tags": [
        "trade-processing",
        "definition"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-set-099",
      "front": "What accrued interest calculation methods are used for bonds?",
      "back": "Corporate and municipal bonds: 30/360 (30 days/month, 360 days/year). U.S. Treasury securities: Actual/365 (actual days in month, 365 days/year).",
      "chapter": "chapter-08",
      "section": 2,
      "tags": [
        "trade-processing",
        "calculation"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-set-100",
      "front": "Which bonds trade 'flat' (without accrued interest)?",
      "back": "Zero-coupon bonds (no periodic interest), defaulted bonds (issuer isn't paying), and income bonds (interest only paid when issuer has sufficient income).",
      "chapter": "chapter-08",
      "section": 2,
      "tags": [
        "trade-processing",
        "definition"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-set-101",
      "front": "Are markups/markdowns disclosed on customer confirmations?",
      "back": "Generally NO for principal transactions, except Nasdaq stock transactions where markup/markdown must be disclosed. Commissions (agency transactions) must always be disclosed.",
      "chapter": "chapter-08",
      "section": 2,
      "tags": [
        "trade-processing",
        "regulation"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-div-102",
      "front": "What are the four key dates in a cash dividend distribution?",
      "back": "1) Declaration date - board announces dividend. 2) Record date - must own by this date. 3) Ex-date - too late to buy (same as record date under T+1). 4) Payment date - dividends paid.",
      "chapter": "chapter-08",
      "section": 3,
      "tags": [
        "distributions",
        "definition"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-div-103",
      "front": "When must you buy stock to receive a cash dividend?",
      "back": "At least one business day BEFORE the record date. Since settlement is T+1, buying on the record date means settlement is one day late.",
      "chapter": "chapter-08",
      "section": 3,
      "tags": [
        "distributions",
        "timing"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-div-104",
      "front": "Why are ex-date and record date now the same for cash dividends?",
      "back": "Because settlement changed to T+1. Previously with T+2 settlement, ex-date was one day before record date to allow time for settlement.",
      "chapter": "chapter-08",
      "section": 3,
      "tags": [
        "distributions",
        "definition"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-div-105",
      "front": "What happens to stock price on the ex-dividend date?",
      "back": "The stock price typically opens lower by approximately the dividend amount. This reflects the cash leaving the company - shareholder has same total value (stock + dividend).",
      "chapter": "chapter-08",
      "section": 3,
      "tags": [
        "distributions",
        "definition"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-div-106",
      "front": "What is a forward stock split?",
      "back": "Increases shares outstanding and proportionally decreases price. Example: 2-for-1 split means 100 shares at $80 become 200 shares at $40. Total value unchanged.",
      "chapter": "chapter-08",
      "section": 3,
      "tags": [
        "distributions",
        "definition"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-div-107",
      "front": "What is a reverse stock split?",
      "back": "Decreases shares outstanding and proportionally increases price. Example: 1-for-10 reverse split means 1000 shares at $1 become 100 shares at $10. Often used to maintain exchange listing requirements.",
      "chapter": "chapter-08",
      "section": 3,
      "tags": [
        "distributions",
        "definition"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-div-108",
      "front": "When is the ex-date for stock splits and stock dividends?",
      "back": "The business day AFTER the payment date. This is DIFFERENT from cash dividends where ex-date equals record date.",
      "chapter": "chapter-08",
      "section": 3,
      "tags": [
        "distributions",
        "timing"
      ],
      "weight": 0.31
    },
    {
      "id": "ch5-muni-109",
      "front": "What is a limited tax GO bond?",
      "back": "A general obligation bond with a limit placed on the tax rate the issuer can assess. Has more credit risk than unlimited tax bonds because tax collections may be insufficient to service debt.",
      "chapter": "chapter-05",
      "section": 1,
      "tags": [
        "municipal-bonds",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-muni-110",
      "front": "What is an industrial development bond (IDB)?",
      "back": "A municipal bond issued to build a facility leased to a private company. The lease payments back the bonds, and the bonds take on the private user's credit rating. Interest may be taxable.",
      "chapter": "chapter-05",
      "section": 1,
      "tags": [
        "municipal-bonds",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-muni-111",
      "front": "Where do municipal bonds trade?",
      "back": "Over-the-counter (OTC), not on exchanges. Municipal bonds settle T+1 (same as corporate bonds) and are typically thinly traded due to buy-and-hold investors.",
      "chapter": "chapter-05",
      "section": 1,
      "tags": [
        "municipal-bonds",
        "trading"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-ic-112",
      "front": "What types of securities can open-end funds issue?",
      "back": "Common stock ONLY. Open-end funds cannot issue bonds or preferred shares. Closed-end funds CAN issue both stocks and bonds.",
      "chapter": "chapter-06",
      "section": 1,
      "tags": [
        "investment-companies",
        "comparison"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-fm-113",
      "front": "What is a target date fund?",
      "back": "A fund that automatically adjusts asset allocation as a target retirement date approaches. Early years: mostly stocks. Near target: mostly bonds. Popular in 401(k) plans.",
      "chapter": "chapter-06",
      "section": 2,
      "tags": [
        "investment-companies",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-fm-114",
      "front": "What is an index fund?",
      "back": "A passively managed fund that tracks the performance of an index like the S&P 500. Generally has lower expense ratios than actively managed funds.",
      "chapter": "chapter-06",
      "section": 2,
      "tags": [
        "investment-companies",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-bs-115",
      "front": "What happens if an LOI (Letter of Intent) is not completed?",
      "back": "No penalty - the sales charge is simply recalculated at the actual level invested. The investor owes the difference between what was paid and what should have been paid.",
      "chapter": "chapter-06",
      "section": 3,
      "tags": [
        "investment-companies",
        "regulation"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-bs-116",
      "front": "Are fund switches within a fund family taxable?",
      "back": "Yes. The IRS treats fund exchanges as taxable events - a sale of the old fund and purchase of the new one. Capital gains tax may be owed even though money stayed in the fund family.",
      "chapter": "chapter-06",
      "section": 3,
      "tags": [
        "investment-companies",
        "taxation"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-exp-117",
      "front": "What is the expense ratio?",
      "back": "Total annual expenses divided by total net assets. Shows what percentage of fund assets go to expenses. All performance is reported AFTER expenses.",
      "chapter": "chapter-06",
      "section": 4,
      "tags": [
        "investment-companies",
        "fees"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-other-118",
      "front": "What is a creation unit for ETFs?",
      "back": "A large block of ETF shares (typically 50,000+) that authorized participants can redeem for underlying assets. This arbitrage mechanism keeps ETF prices near NAV.",
      "chapter": "chapter-06",
      "section": 6,
      "tags": [
        "packaged-products",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-other-119",
      "front": "What is passive income from a DPP?",
      "back": "Income from a limited partnership investment. Passive losses can ONLY offset other passive gains - they cannot offset ordinary income from wages.",
      "chapter": "chapter-06",
      "section": 6,
      "tags": [
        "packaged-products",
        "taxation"
      ],
      "weight": 0.44
    },
    {
      "id": "ch7-mkt-120",
      "front": "What is the third market?",
      "back": "OTC trading of exchange-listed securities. Creates competition for exchanges and often benefits institutional investors who can negotiate better prices for large orders.",
      "chapter": "chapter-07",
      "section": 1,
      "tags": [
        "markets",
        "definition"
      ],
      "weight": 0.38
    },
    {
      "id": "ch7-mkt-121",
      "front": "Who regulates the second, third, and fourth markets?",
      "back": "FINRA. The first market (exchanges) are self-regulated under SEC oversight. Municipal securities are regulated by the MSRB.",
      "chapter": "chapter-07",
      "section": 1,
      "tags": [
        "markets",
        "regulation"
      ],
      "weight": 0.38
    },
    {
      "id": "ch7-mkt-122",
      "front": "What is best execution?",
      "back": "The requirement that broker-dealers route orders to wherever they'll get the best overall outcome for the customer - considering price, speed, and likelihood of execution.",
      "chapter": "chapter-07",
      "section": 1,
      "tags": [
        "markets",
        "regulation"
      ],
      "weight": 0.38
    },
    {
      "id": "ch7-mkt-123",
      "front": "What is the spread in securities trading?",
      "back": "The difference between the bid price (what a dealer will pay to buy) and the ask price (what a dealer will accept to sell). Represents the dealer's potential profit.",
      "chapter": "chapter-07",
      "section": 1,
      "tags": [
        "markets",
        "definition"
      ],
      "weight": 0.38
    },
    {
      "id": "ch8-ord-124",
      "front": "What is a day order vs. a GTC order?",
      "back": "Day order: Expires at market close if not filled. GTC (Good-til-canceled): Remains active until filled or canceled by the customer.",
      "chapter": "chapter-08",
      "section": 1,
      "tags": [
        "trade-processing",
        "comparison"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-ord-125",
      "front": "What is a pump and dump scheme?",
      "back": "Market manipulation where traders coordinate to buy a security at higher prices, creating false demand. When outside investors pile in, the manipulators sell at inflated prices.",
      "chapter": "chapter-08",
      "section": 1,
      "tags": [
        "trade-processing",
        "prohibited-practices"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-ord-126",
      "front": "What does 'trading ahead of research' mean?",
      "back": "Trading based on advance knowledge of a pending research report recommendation. Prohibited because it uses non-public information about activity that will likely move prices.",
      "chapter": "chapter-08",
      "section": 1,
      "tags": [
        "trade-processing",
        "prohibited-practices"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-set-127",
      "front": "What is book entry form for securities?",
      "back": "Electronic records of ownership rather than physical certificates. Almost all securities are now held in book entry form at the DTC.",
      "chapter": "chapter-08",
      "section": 2,
      "tags": [
        "trade-processing",
        "definition"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-set-128",
      "front": "What is a stock power or bond power?",
      "back": "A separate document that transfers ownership of a physical certificate without signing the certificate itself. Allows certificate and transfer document to be mailed separately for safety.",
      "chapter": "chapter-08",
      "section": 2,
      "tags": [
        "trade-processing",
        "definition"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-div-129",
      "front": "What is a stock dividend?",
      "back": "Similar to a small forward split - shareholders receive additional shares (e.g., 10% stock dividend = 10 new shares per 100 owned). Price adjusts proportionally; total value unchanged.",
      "chapter": "chapter-08",
      "section": 3,
      "tags": [
        "distributions",
        "definition"
      ],
      "weight": 0.31
    },
    {
      "id": "ch5-mm-130",
      "front": "What is the maximum maturity for SEC registration exemption of money market securities?",
      "back": "270 days. Money market securities with maturities under 270 days are exempt from SEC registration, streamlining the issuance process.",
      "chapter": "chapter-05",
      "section": 2,
      "tags": [
        "money-market",
        "regulation"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-muni-131",
      "front": "What is a private activity bond (PAB)?",
      "back": "A taxable municipal bond that funds private activities not qualifying for federal tax exemption. Interest is taxable at federal level but often tax-free at state/local level.",
      "chapter": "chapter-05",
      "section": 1,
      "tags": [
        "municipal-bonds",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-dist-132",
      "front": "Why is recommending Class B shares for large investments prohibited?",
      "back": "Large investors should be in Class A shares where breakpoint discounts reduce sales charges. Class B shares have no breakpoints, higher 12b-1 fees, and cost more over time.",
      "chapter": "chapter-06",
      "section": 5,
      "tags": [
        "investment-companies",
        "prohibited-practices"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-other-133",
      "front": "What types of REITs exist based on registration and trading?",
      "back": "Private REITs: Not SEC registered, not traded, accredited investors only. Non-listed REITs: SEC registered but not traded. Listed REITs: SEC registered and exchange traded, most common for retail.",
      "chapter": "chapter-06",
      "section": 6,
      "tags": [
        "packaged-products",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch7-mkt-134",
      "front": "What is EMMA (Electronic Municipal Market Access)?",
      "back": "A public website maintained by the MSRB for municipal bond pricing and disclosure information. Part of the OTC trading infrastructure for municipal securities.",
      "chapter": "chapter-07",
      "section": 1,
      "tags": [
        "markets",
        "regulation"
      ],
      "weight": 0.38
    },
    {
      "id": "ch8-set-135",
      "front": "What must dealer-to-dealer trade confirmations include?",
      "back": "Trade date, settlement date, size, security, execution price, and CUSIP number. They do NOT include customer information or commission details (that's between firm and customer).",
      "chapter": "chapter-08",
      "section": 2,
      "tags": [
        "trade-processing",
        "regulation"
      ],
      "weight": 0.31
    },
    {
      "id": "ch8-set-136",
      "front": "What additional disclosures are required for municipal bond confirmations?",
      "back": "Issuer name, interest rate, maturity date, callable status, revenue source (if revenue bond), yield and dollar price. For callable bonds at premium: yield to worst.",
      "chapter": "chapter-08",
      "section": 2,
      "tags": [
        "trade-processing",
        "regulation"
      ],
      "weight": 0.31
    },
    {
      "id": "ch5-muni-137",
      "front": "What backs a special tax bond?",
      "back": "A tax other than ad valorem (property) tax, such as excise taxes on cigarettes, liquor, or gasoline. The tax source doesn't have to relate to the project being funded.",
      "chapter": "chapter-05",
      "section": 1,
      "tags": [
        "municipal-bonds",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch6-ic-138",
      "front": "How do closed-end fund shares differ from open-end fund shares in trading?",
      "back": "Closed-end: Trade on exchanges throughout the day at market prices (may be above or below NAV). Open-end: Redeemed with the fund at NAV using forward pricing (next calculated NAV, typically 4 PM).",
      "chapter": "chapter-06",
      "section": 1,
      "tags": [
        "investment-companies",
        "comparison"
      ],
      "weight": 0.44
    },
    {
      "id": "ch8-ord-139",
      "front": "What is naked short selling?",
      "back": "Short selling without actually borrowing shares, creating phantom supply. Prohibited under Regulation SHO, which requires brokers to 'locate' shares before short sales.",
      "chapter": "chapter-08",
      "section": 1,
      "tags": [
        "trade-processing",
        "prohibited-practices"
      ],
      "weight": 0.31
    },
    {
      "id": "ch6-bs-140",
      "front": "What is the maximum sales charge for mutual funds?",
      "back": "8.5% of POP (Public Offering Price). To charge this maximum, funds must offer breakpoints and dividend reinvestment at NAV.",
      "chapter": "chapter-06",
      "section": 3,
      "tags": [
        "investment-companies",
        "fees"
      ],
      "weight": 0.44
    },
    {
      "id": "ch5-muni-141",
      "front": "What is a capital appreciation bond (CAB)?",
      "back": "A municipal zero-coupon bond where only the discounted principal amount counts against the issuer's debt limit. Good for municipalities close to their debt limit.",
      "chapter": "chapter-05",
      "section": 1,
      "tags": [
        "municipal-bonds",
        "definition"
      ],
      "weight": 0.44
    },
    {
      "id": "ch8-ord-142",
      "front": "What is required to alter an executed order ticket?",
      "back": "Written approval from a branch manager or compliance officer, plus documentation of the essential facts and reason for the change. Prevents falsification of records.",
      "chapter": "chapter-08",
      "section": 1,
      "tags": [
        "trade-processing",
        "regulation"
      ],
      "weight": 0.31
    }
  ]
}